zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/startup_MIMXRT2663.cpp
WEAK void Reserved164_IRQHandler(void)
{
    Reserved164_DriverIRQHandler();
}

WEAK void HSP_QTMR0_IRQHandler(void)
{
    HSP_QTMR0_DriverIRQHandler();
}

WEAK void HSP_QTMR1_IRQHandler(void)
{
    HSP_QTMR1_DriverIRQHandler();
}

WEAK void HSP_QTMR2_IRQHandler(void)
{
    HSP_QTMR2_DriverIRQHandler();
}

WEAK void HSP_QTMR3_IRQHandler(void)
{
    HSP_QTMR3_DriverIRQHandler();
}

WEAK void HSP_EQDC0_IRQHandler(void)
{
    HSP_EQDC0_DriverIRQHandler();
}

WEAK void HSP_EQDC1_IRQHandler(void)
{
    HSP_EQDC1_DriverIRQHandler();
}

WEAK void HSP_EQDC2_IRQHandler(void)
{
    HSP_EQDC2_DriverIRQHandler();
}

WEAK void HSP_EQDC3_IRQHandler(void)
{
    HSP_EQDC3_DriverIRQHandler();
}

WEAK void HSP_SINC0_CH0_IRQHandler(void)
{
    HSP_SINC0_CH0_DriverIRQHandler();
}

WEAK void HSP_SINC0_CH1_IRQHandler(void)
{
    HSP_SINC0_CH1_DriverIRQHandler();
}

WEAK void HSP_SINC0_CH2_IRQHandler(void)
{
    HSP_SINC0_CH2_DriverIRQHandler();
}

WEAK void HSP_SINC0_CH3_IRQHandler(void)
{
    HSP_SINC0_CH3_DriverIRQHandler();
}

WEAK void HSP_SINC1_CH0_IRQHandler(void)
{
    HSP_SINC1_CH0_DriverIRQHandler();
}

WEAK void HSP_SINC1_CH1_IRQHandler(void)
{
    HSP_SINC1_CH1_DriverIRQHandler();
}

WEAK void HSP_SINC1_CH2_IRQHandler(void)
{
    HSP_SINC1_CH2_DriverIRQHandler();
}

WEAK void HSP_SINC1_CH3_IRQHandler(void)
{
    HSP_SINC1_CH3_DriverIRQHandler();
}

WEAK void HSP_FLEXCAN0_IRQHandler(void)
{
    FLEXCAN_DriverIRQHandler(0U);
}

WEAK void HSP_FLEXCAN0_ERROR_IRQHandler(void)
{
    HSP_FLEXCAN0_ERROR_DriverIRQHandler();
}

WEAK void HSP_FLEXCAN1_IRQHandler(void)
{
    FLEXCAN_DriverIRQHandler(1U);
}

WEAK void HSP_FLEXCAN1_ERROR_IRQHandler(void)
{
    HSP_FLEXCAN1_ERROR_DriverIRQHandler();
}

WEAK void HSP_FLEXCAN2_IRQHandler(void)
{
    FLEXCAN_DriverIRQHandler(2U);
}

WEAK void HSP_FLEXCAN2_ERROR_IRQHandler(void)
{
    HSP_FLEXCAN2_ERROR_DriverIRQHandler();
}

WEAK void HSP_FLEXIO0_IRQHandler(void)
{
    FLEXIO_CommonDriverIRQHandler(0U);
}

WEAK void HSP_FLEXIO1_IRQHandler(void)
{
    FLEXIO_CommonDriverIRQHandler(1U);
}

WEAK void HSP_FLEXIO2_IRQHandler(void)
{
    FLEXIO_CommonDriverIRQHandler(2U);
}

WEAK void HSP_I3C_IRQHandler(void)
{
    I3C_DriverIRQHandler(0U);
}

WEAK void HSP_LPI2C0_IRQHandler(void)
{
    LPI2C_DriverIRQHandler(0U);
}

WEAK void HSP_LPI2C1_IRQHandler(void)
{
    LPI2C_DriverIRQHandler(1U);
}

WEAK void Reserved193_IRQHandler(void)
{
    Reserved193_DriverIRQHandler();
}

WEAK void Reserved194_IRQHandler(void)
{
    Reserved194_DriverIRQHandler();
}

WEAK void HSP_LPSPI0_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(0U);
}

WEAK void HSP_LPSPI1_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(1U);
}

WEAK void HSP_LPSPI2_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(2U);
}

WEAK void HSP_LPSPI3_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(3U);
}

WEAK void HSP_LPSPI4_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(4U);
}

WEAK void HSP_LPUART0_IRQHandler(void)
{
    LPUART_DriverIRQHandler(0U);
}

WEAK void HSP_LPUART1_IRQHandler(void)
{
    LPUART_DriverIRQHandler(1U);
}

WEAK void HSP_LPUART2_IRQHandler(void)
{
    LPUART_DriverIRQHandler(2U);
}

WEAK void HSP_LPUART3_IRQHandler(void)
{
    LPUART_DriverIRQHandler(3U);
}

WEAK void HSP_LPUART4_IRQHandler(void)
{
    LPUART_DriverIRQHandler(4U);
}

WEAK void HSP_LPUART5_IRQHandler(void)
{
    LPUART_DriverIRQHandler(5U);
}

WEAK void HSP_GPIO0_CH0_IRQHandler(void)
{
    HSP_GPIO0_CH0_DriverIRQHandler();
}

WEAK void HSP_GPIO0_CH1_IRQHandler(void)
{
    HSP_GPIO0_CH1_DriverIRQHandler();
}

WEAK void HSP_GPIO1_CH0_IRQHandler(void)
{
    HSP_GPIO1_CH0_DriverIRQHandler();
}

WEAK void HSP_GPIO1_CH1_IRQHandler(void)
{
    HSP_GPIO1_CH1_DriverIRQHandler();
}

WEAK void HSP_GPIO2_CH0_IRQHandler(void)
{
    HSP_GPIO2_CH0_DriverIRQHandler();
}

WEAK void HSP_GPIO2_CH1_IRQHandler(void)
{
    HSP_GPIO2_CH1_DriverIRQHandler();
}

WEAK void HSP_GPIO3_CH0_IRQHandler(void)
{
    HSP_GPIO3_CH0_DriverIRQHandler();
}

WEAK void HSP_GPIO3_CH1_IRQHandler(void)
{
    HSP_GPIO3_CH1_DriverIRQHandler();
}

WEAK void HSP_GPIO4_CH0_IRQHandler(void)
{
    HSP_GPIO4_CH0_DriverIRQHandler();
}

WEAK void HSP_GPIO4_CH1_IRQHandler(void)
{
    HSP_GPIO4_CH1_DriverIRQHandler();
}

WEAK void Reserved216_IRQHandler(void)
{
    Reserved216_DriverIRQHandler();
}

WEAK void Reserved217_IRQHandler(void)
{
    Reserved217_DriverIRQHandler();
}

WEAK void Reserved218_IRQHandler(void)
{
    Reserved218_DriverIRQHandler();
}

WEAK void Reserved219_IRQHandler(void)
{
    Reserved219_DriverIRQHandler();
}

WEAK void Reserved220_IRQHandler(void)
{
    Reserved220_DriverIRQHandler();
}

WEAK void WAKE_TRDC_IRQHandler(void)
{
    WAKE_TRDC_DriverIRQHandler();
}

WEAK void WAKE_XBAR_CH0_IRQHandler(void)
{
    WAKE_XBAR_CH0_DriverIRQHandler();
}

WEAK void WAKE_XBAR_CH1_IRQHandler(void)
{
    WAKE_XBAR_CH1_DriverIRQHandler();
}

WEAK void WAKE_EDMA3_CH0_IRQHandler(void)
{
    EDMA_DriverIRQHandler(3U, 0U);
}

WEAK void WAKE_EDMA3_CH1_IRQHandler(void)
{
    EDMA_DriverIRQHandler(3U, 1U);
}

WEAK void WAKE_EDMA3_CH2_IRQHandler(void)
{
    EDMA_DriverIRQHandler(3U, 2U);
}

WEAK void WAKE_EDMA3_CH3_IRQHandler(void)
{
    EDMA_DriverIRQHandler(3U, 3U);
}

WEAK void WAKE_EDMA3_CH4_IRQHandler(void)
{
    EDMA_DriverIRQHandler(3U, 4U);
}

WEAK void WAKE_EDMA3_CH5_IRQHandler(void)
{
    EDMA_DriverIRQHandler(3U, 5U);
}

WEAK void WAKE_EDMA3_CH6_IRQHandler(void)
{
    EDMA_DriverIRQHandler(3U, 6U);
}

WEAK void WAKE_EDMA3_CH7_IRQHandler(void)
{
    EDMA_DriverIRQHandler(3U, 7U);
}

WEAK void WAKE_ACMP0_IRQHandler(void)
{
    WAKE_ACMP0_DriverIRQHandler();
}

WEAK void WAKE_ACMP1_IRQHandler(void)
{
    WAKE_ACMP1_DriverIRQHandler();
}

WEAK void WAKE_ACMP2_IRQHandler(void)
{
    WAKE_ACMP2_DriverIRQHandler();
}

WEAK void WAKE_ACMP3_IRQHandler(void)
{
    WAKE_ACMP3_DriverIRQHandler();
}

WEAK void WAKE_EWM_IRQHandler(void)
{
    WAKE_EWM_DriverIRQHandler();
}

WEAK void WAKE_FREQME_IRQHandler(void)
{
    WAKE_FREQME_DriverIRQHandler();
}

WEAK void WAKE_LPTMR0_IRQHandler(void)
{
    WAKE_LPTMR0_DriverIRQHandler();
}

